In [2]:
import pandas as pd

In [46]:
import numpy as np

In [4]:
data=np.random.randn(4,3) # 4' e 3'lük random matris oluşturduk.

In [5]:
data

array([[ 0.62337798, -0.54211581,  1.48493042],
       [-0.92006604, -0.3865856 , -1.96819094],
       [-0.07651446,  0.78425347,  0.2233025 ],
       [ 0.50477648,  1.74117014,  0.19701795]])

In [6]:
dataFrame=pd.DataFrame(data)

In [7]:
dataFrame       # satır ve sütun şeklinde dataframe çeviridik.

          0         1         2
0  0.623378 -0.542116  1.484930
1 -0.920066 -0.386586 -1.968191
2 -0.076514  0.784253  0.223302
3  0.504776  1.741170  0.197018

In [8]:
yeniFrame=pd.DataFrame(data,index=["atlas","atil","zeynep","mehmet"],columns=["yas","maas","çalışmaSaati"])

In [9]:
yeniFrame       # satırlara ve sütunlara gelecek etiketleri yazıp çağırdık.

             yas      maas  çalışmaSaati
atlas   0.623378 -0.542116      1.484930
atil   -0.920066 -0.386586     -1.968191
zeynep -0.076514  0.784253      0.223302
mehmet  0.504776  1.741170      0.197018

In [10]:
yeniFrame["yas"]  # yas kolonunu çağırdık.

atlas     0.623378
atil     -0.920066
zeynep   -0.076514
mehmet    0.504776
Name: yas, dtype: float64

In [11]:
yeniFrame[["maas","yas"]] # iki dizi açıp sadece yas ve maas kolonunu istedik.

            maas       yas
atlas  -0.542116  0.623378
atil   -0.386586 -0.920066
zeynep  0.784253 -0.076514
mehmet  1.741170  0.504776

In [12]:
yeniFrame.loc["atil"] # satır seçmek istersek böyle yazacağız.Atilin bilgilerini istedik.

yas            -0.920066
maas           -0.386586
çalışmaSaati   -1.968191
Name: atil, dtype: float64

In [13]:
yeniFrame.loc["atlas"]

yas             0.623378
maas           -0.542116
çalışmaSaati    1.484930
Name: atlas, dtype: float64

In [14]:
yeniFrame.iloc[1] # 1. satırdaki kişinin bilgilerini getiricek

yas            -0.920066
maas           -0.386586
çalışmaSaati   -1.968191
Name: atil, dtype: float64

In [15]:
yeniFrame

             yas      maas  çalışmaSaati
atlas   0.623378 -0.542116      1.484930
atil   -0.920066 -0.386586     -1.968191
zeynep -0.076514  0.784253      0.223302
mehmet  0.504776  1.741170      0.197018

In [16]:
yeniFrame["emeklilik yaşı"]=yeniFrame["yas"]+yeniFrame["yas"] 
# yeni kolon ekledik.yaşı iki kez toplayınca emeklilik yaşını verdi.

In [17]:
yeniFrame

             yas      maas  çalışmaSaati  emeklilik yaşı
atlas   0.623378 -0.542116      1.484930        1.246756
atil   -0.920066 -0.386586     -1.968191       -1.840132
zeynep -0.076514  0.784253      0.223302       -0.153029
mehmet  0.504776  1.741170      0.197018        1.009553

In [18]:
yeniFrame.drop("emeklilik yaşı",axis=1) # emeklilik kolonunu sildik.emeklilik kolonunu sütunda arayabilmesi için axis=1 yazdık.

             yas      maas  çalışmaSaati
atlas   0.623378 -0.542116      1.484930
atil   -0.920066 -0.386586     -1.968191
zeynep -0.076514  0.784253      0.223302
mehmet  0.504776  1.741170      0.197018

In [19]:
yeniFrame.drop("mehmet") # mehmeti sildik. satır olduğu için axis=0 yazmamız gerekiyordu fakat satır için yazmasak da siler

             yas      maas  çalışmaSaati  emeklilik yaşı
atlas   0.623378 -0.542116      1.484930        1.246756
atil   -0.920066 -0.386586     -1.968191       -1.840132
zeynep -0.076514  0.784253      0.223302       -0.153029

In [20]:
yeniFrame  # framei çağırdık fakat silmeden getirdi.

             yas      maas  çalışmaSaati  emeklilik yaşı
atlas   0.623378 -0.542116      1.484930        1.246756
atil   -0.920066 -0.386586     -1.968191       -1.840132
zeynep -0.076514  0.784253      0.223302       -0.153029
mehmet  0.504776  1.741170      0.197018        1.009553

In [21]:
yeniFrame.drop("emeklilik yaşı",axis=1,inplace=True) # inplace=true yaptığımız zaman silindiğini görüyoruz.

In [22]:
yeniFrame

             yas      maas  çalışmaSaati
atlas   0.623378 -0.542116      1.484930
atil   -0.920066 -0.386586     -1.968191
zeynep -0.076514  0.784253      0.223302
mehmet  0.504776  1.741170      0.197018

In [23]:
yeniFrame.loc["atil"]["yas"] # yalnızca atilin yaşını çağırdık.

-0.9200660425918813

In [24]:
yeniFrame<0 # o'dan küçük değerleri bulmak istiyoruz

          yas   maas  çalışmaSaati
atlas   False   True         False
atil     True   True          True
zeynep   True  False         False
mehmet  False  False         False

In [25]:
booleanFrame=yeniFrame<0

In [26]:
booleanFrame

          yas   maas  çalışmaSaati
atlas   False   True         False
atil     True   True          True
zeynep   True  False         False
mehmet  False  False         False

In [27]:
yeniFrame[booleanFrame] # yeniframe içinde yalnızda 0'dan küçük değerleri gösterir.

             yas      maas  çalışmaSaati
atlas        NaN -0.542116           NaN
atil   -0.920066 -0.386586     -1.968191
zeynep -0.076514       NaN           NaN
mehmet       NaN       NaN           NaN

In [28]:
yeniFrame[yeniFrame["yas"]>0]  # yaşı sadece 0'dan büyük olanları getirdi.

             yas      maas  çalışmaSaati
atlas   0.623378 -0.542116      1.484930
mehmet  0.504776  1.741170      0.197018

In [30]:
yeniFrame

             yas      maas  çalışmaSaati
atlas   0.623378 -0.542116      1.484930
atil   -0.920066 -0.386586     -1.968191
zeynep -0.076514  0.784253      0.223302
mehmet  0.504776  1.741170      0.197018

In [31]:
yeniListe=["ati","zey","meh","atl"]

In [32]:
yeniFrame["yeni indeks"]=yeniListe # yeni bir kolon ekledik.

In [33]:
yeniFrame

             yas      maas  çalışmaSaati yeni indeks
atlas   0.623378 -0.542116      1.484930         ati
atil   -0.920066 -0.386586     -1.968191         zey
zeynep -0.076514  0.784253      0.223302         meh
mehmet  0.504776  1.741170      0.197018         atl

In [35]:
yeniFrame.set_index("yeni indeks",inplace=True) # yeni indeks kolonu gitti ve indeks olarak yazıldı.

In [36]:
yeniFrame

                  yas      maas  çalışmaSaati
yeni indeks
ati          0.623378 -0.542116      1.484930
zey         -0.920066 -0.386586     -1.968191
meh         -0.076514  0.784253      0.223302
atl          0.504776  1.741170      0.197018

In [38]:
ilkIndeksler=["simpson","simpson","simpson","sout park","sout park","sout park"]

In [39]:
içIndeksler=["homer","bart","marge","cartman","keny","kyle"]

In [40]:
birleşmişIndeks=list(zip(ilkIndeksler,içIndeksler)) # iki indeksi zip ile birleştirdik.

In [41]:
birleşmişIndeks

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('sout park', 'cartman'),
 ('sout park', 'keny'),
 ('sout park', 'kyle')]

In [42]:
birleşmişIndeks=pd.MultiIndex.from_tuples(birleşmişIndeks) # çoklu indeksleme yaptık.

In [43]:
birleşmişIndeks

MultiIndex([(  'simpson',   'homer'),
            (  'simpson',    'bart'),
            (  'simpson',   'marge'),
            ('sout park', 'cartman'),
            ('sout park',    'keny'),
            ('sout park',    'kyle')],
           )

In [44]:
cizgiFilm=[[40,"a"],[10,"b"],[30,"c"],[9,"d"],[10,"e"],[11,"f"]]

In [48]:
cizgiFilmNumpyDizisi=np.array(cizgiFilm)

In [49]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birleşmişIndeks,columns=["yas","meslek"])

In [50]:
cizgiFilmDataFrame

                  yas meslek
simpson   homer    40      a
          bart     10      b
          marge    30      c
sout park cartman   9      d
          keny     10      e
          kyle     11      f

In [51]:
cizgiFilmDataFrame.loc["simpson"] # simpson kısmını getirdik.

      yas meslek
homer  40      a
bart   10      b
marge  30      c

In [52]:
cizgiFilmDataFrame.loc["simpson"].loc["homer"] # içinden indeksi seçtik

yas       40
meslek     a
Name: homer, dtype: object